/**
 * @descript Array 类型数据处理工具函数集
 *
 * @author 济南晨霜信息技术有限公司
 * @mobile 18560000860 / 18754137913
 *
 * @list 函数列表
 * ========================================================================================================================
 * = isArray = 判断一个数据是否是 Array 类型
 * ========================================================================================================================
 */
/**
 * 判断一个数据是否是 Array 类型
 * @param {Any} variable 需要验证的数据
 * @returns {Boolean} true: 是 Array 类型数据；false: 不是 Array 类型数据；
 */
export function isArray(val) {
    return Array.isArray(val);
}
